app/controllers/courses_controller.rb

  def open
    @course = Course.find_by_id(params[:id])
    @course.isopen = true
    @course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "isopen" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["isopen", "t"], ["updated_at", "2017-01-02 02:11:40.417068"], ["id", 1]]

  def close
    @course = Course.find_by_id(params[:id])
    @course.isopen = false
    @course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "isopen" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["isopen", "f"], ["updated_at", "2017-01-02 02:12:07.924854"], ["id", 1]]

  def list
    # mao changed #2 for searching
    @course=Course.where(isopen: true)
    @courses_number = -1 # used for search result
    unless params[:query].blank?
      @course=Course.where(isopen: true).where( 'name  LIKE :search OR course_code LIKE :search OR course_type LIKE :search OR teaching_type LIKE :search OR exam_type LIKE :search', search:"%#{params[:query]}%")
      @courses_number=@course.length
    end
    @course=@course-current_user.courses
    # mao changed #2 for searching
    # ts add
    @course.each do |course0|
      course0_week = get_week_bool_matrix(course0.course_week)
      course0_time = get_time_bool_matrix(course0.course_time)
      current_user.courses.each do |course1|
        course1_week = get_week_bool_matrix(course1.course_week)
        if if_has_same_week(course0_week,course1_week)==true
          course1_time = get_time_bool_matrix(course1.course_time)
          if if_has_same_time(course0_time,course1_time)==true
            course0.conflict=true
            course0.conflict_course=course1.name
            course0.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."isopen" = $1  [["isopen", "t"]]
SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
UPDATE "courses" SET "conflict" = $1, "conflict_course" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["conflict", "t"], ["conflict_course", "计算机算法设计与分析"], ["updated_at", "2017-01-02 12:14:03.831407"], ["id", 2]]

  def select
    @course=Course.find_by_id(params[:id])
    current_user.courses<<@course
    @course.student_num +=1
    @course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", 1], ["updated_at", "2017-01-02 05:27:30.197192"], ["id", 15]]

  def quit
    @course=Course.find_by_id(params[:id])
    current_user.courses.delete(@course)
    @course.student_num -=1
    @course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "courses" SET "student_num" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["student_num", 0], ["updated_at", "2017-01-02 05:27:35.726153"], ["id", 15]]

  def show_courses_table
    @ts_courses = current_user.courses
    @course_matrix = nil
    current_user.courses.each do |course|
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]